In [ ]:
Empty Notebook

In [3]:
import numpy as np
import pandas as pd

In [78]:
from pandas import Series, DataFrame

# 5.1 Introduction to pandas Data Structures

### Series
> The simplest Series is formed from only an array of data

In [77]:
obj = pd.Series([4, 7, -5, 3])

In [10]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

> You can get the array representation and index object of the Series via its array and index attributes

In [11]:
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [12]:
obj.index

RangeIndex(start=0, stop=4, step=1)

> create a Series with an index identifying each data point with a label

In [22]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [23]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [27]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

> you can use labels in the index when selecting single values or a set of values:

In [28]:
obj2["a"]

np.int64(-5)

In [29]:
obj2["d"] = 6

In [30]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

>  filtering with a Boolean array, scalar multiplication, or applying math functions, will preserve the index-value link:

In [31]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [32]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [35]:
import numpy as np

In [37]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

> Another way to think about a Series is as a fixed-length, ordered dictionary, as it is a mapping of index values to data values. It can be used in many contexts where you might use a dictionary:

In [39]:
"b" in obj2

True

In [40]:
"e" in obj2

False

> Should you have data contained in a Python dictionary, you can create a Series from it by passing the dictionary:

In [41]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 50000}

In [42]:
obj3 = pd.Series(sdata)

In [43]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah      50000
dtype: int64

> A Series can be converted back to a dictionary

In [44]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 50000}

Dictionary index default overide key order

In [45]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [46]:
obj4 = pd.Series(sdata, index = states)

In [47]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

> The ```isna``` and ```notna``` functions in pandas should be used to detect missing data:

In [48]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [49]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

> as instance methods:

In [83]:
obj4.isna()

state
California     True
Ohio          False
Oregon        False
Texas         False
Name: population, dtype: bool

> A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations:

In [84]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah      50000
dtype: int64

In [85]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

Add two obj series together

In [52]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

> Both the Series object itself and its index have a name attribute, which integrates with other areas of pandas functionality:

In [53]:
obj4.name = "population"

In [54]:
obj4.index.name = "state"

In [55]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [56]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

> index can be altered in place by assignment:

In [58]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [59]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

> many ways to construct a DataFrame, though one of the most common is from a dictionary of equal-length lists or NumPy arrays:

In [86]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 20002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

> columns are placed according to the order of the keys in data (which depends on their insertion order in the dictionary):

In [63]:
In [50]: frame

    state   year  pop
0    Ohio   2000  1.5
1    Ohio   2001  1.7
2    Ohio  20002  3.6
3  Nevada   2001  2.4
4  Nevada   2002  2.9
5  Nevada   2003  3.2

In [64]:
frame.head()

    state   year  pop
0    Ohio   2000  1.5
1    Ohio   2001  1.7
2    Ohio  20002  3.6
3  Nevada   2001  2.4
4  Nevada   2002  2.9

In [65]:
frame.tail()

    state   year  pop
1    Ohio   2001  1.7
2    Ohio  20002  3.6
3  Nevada   2001  2.4
4  Nevada   2002  2.9
5  Nevada   2003  3.2

> If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order:

In [66]:
pd.DataFrame(data, columns = ["year", "state", "pop"])

    year   state  pop
0   2000    Ohio  1.5
1   2001    Ohio  1.7
2  20002    Ohio  3.6
3   2001  Nevada  2.4
4   2002  Nevada  2.9
5   2003  Nevada  3.2

> If you pass a column that isn’t contained in the dictionary, it will appear with missing values in the result:

In [68]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])

In [69]:
frame2

    year   state  pop debt
0   2000    Ohio  1.5  NaN
1   2001    Ohio  1.7  NaN
2  20002    Ohio  3.6  NaN
3   2001  Nevada  2.4  NaN
4   2002  Nevada  2.9  NaN
5   2003  Nevada  3.2  NaN

In [70]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

> A column in a DataFrame can be retrieved as a Series either by dictionary-like notation or by using the dot attribute notation:

In [71]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [72]:
frame2.year

0     2000
1     2001
2    20002
3     2001
4     2002
5     2003
Name: year, dtype: int64

> Rows can also be retrieved by position or name with the special ```iloc``` and ```loc``` attributes

In [73]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [74]:
frame2.iloc[2]

year     20002
state     Ohio
pop        3.6
debt       NaN
Name: 2, dtype: object

> Columns can be modified by assignment. For example, the empty debt column could be assigned a scalar value or an array of values:

In [75]:
frame2["debt"] = 16.5

In [76]:
frame2

    year   state  pop  debt
0   2000    Ohio  1.5  16.5
1   2001    Ohio  1.7  16.5
2  20002    Ohio  3.6  16.5
3   2001  Nevada  2.4  16.5
4   2002  Nevada  2.9  16.5
5   2003  Nevada  3.2  16.5

> scalar

In [87]:
frame2["debt"] = np.arange(6.)
frame2

    year   state  pop  debt
0   2000    Ohio  1.5   0.0
1   2001    Ohio  1.7   1.0
2  20002    Ohio  3.6   2.0
3   2001  Nevada  2.4   3.0
4   2002  Nevada  2.9   4.0
5   2003  Nevada  3.2   5.0

> When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame.
>
> If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any index values not present:

In [89]:
val = pd.Series([-1.2, -1.5, -1.7], index= [2, 4, 5])

In [90]:
frame2["debt"] = val

In [91]:
frame2

    year   state  pop  debt
0   2000    Ohio  1.5   NaN
1   2001    Ohio  1.7   NaN
2  20002    Ohio  3.6  -1.2
3   2001  Nevada  2.4   NaN
4   2002  Nevada  2.9  -1.5
5   2003  Nevada  3.2  -1.7

> The ```del``` keyword will delete columns like with a dictionary. As an example, I first add a new column of Boolean values where the state column equals "Ohio":

check if in eastern column, state ```==``` Ohio

In [92]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [93]:
frame2

    year   state  pop  debt  eastern
0   2000    Ohio  1.5   NaN     True
1   2001    Ohio  1.7   NaN     True
2  20002    Ohio  3.6  -1.2     True
3   2001  Nevada  2.4   NaN    False
4   2002  Nevada  2.9  -1.5    False
5   2003  Nevada  3.2  -1.7    False

> del method can then be used to remove this column:

In [94]:
del frame2["eastern"]

In [95]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

> Another common form of data is a nested dictionary of dictionaries:

In [97]:
# populations = {{},{}}
populations = {"Ohio": {2000: 1.5, 2001: 1.7 , 2002: 3.6}, "Nevada" : { 2001: 2.4, 2002: 2.9}}

In [98]:
frame3 = pd.DataFrame(populations)

In [99]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

> You can transpose ```T``` the DataFrame (swap rows and columns) with similar syntax to a NumPy array:

> ```Warning!```
Note that transposing discards the column data types if the columns do not all have the same data type, so transposing and then transposing back may lose the previous type information. The columns become arrays of pure Python objects in this case.

In [100]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

> The keys in the inner dictionaries are combined to form the index in the result. This isn’t true if an explicit index is specified:

In [101]:
pd.DataFrame(populations, index = [2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

> Dictionaries of Series are treated in much the same way:

In [102]:
pdata = {"Ohio": frame3["Ohio"][:-1] ,"Nevada": frame3["Nevada"] [:2]}

In [107]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

> If a DataFrame’s ```index``` and columns have their ```name``` attributes set, these will also be displayed:

In [108]:
frame3.index.name = "year"

In [111]:
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

> Unlike Series, DataFrame does not have a name attribute. DataFrame's ```to_numpy``` method returns the data contained in the DataFrame as a two-dimensional ndarray:

In [112]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

> If the DataFrame’s columns are different data types, the data type of the returned array will be chosen to accommodate all of the columns:

In [113]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [20002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

### Index Objects

> pandas’s Index objects are responsible for holding the ```axis``` labels (including a DataFrame's column names) and other metadata (like the axis name or names). Any array or other sequence of labels you use when constructing a Series or DataFrame is internally converted to an Index:

In [118]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [119]:
index = obj.index

In [120]:
index

Index(['a', 'b', 'c'], dtype='object')

In [122]:
index[1:]

Index(['b', 'c'], dtype='object')

> Index objects are ```immutable``` and thus can’t be modified by the user:

In [125]:
index[1] = "d" #TypeError

TypeError: Index does not support mutable operations

> Immutability makes it safer to share Index objects among data structures:

In [127]:
labels = pd.Index(np.arange(3))

In [128]:
labels

Index([0, 1, 2], dtype='int64')

In [130]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [131]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [132]:
obj2.index is labels

True

> In addition to being array-like, an Index also behaves like a fixed-size set:

In [133]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [134]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [135]:
"Ohio" in frame3.columns

True

In [136]:
2003 in frame3.index

False

>Unlike Python sets, a pandas Index can contain duplicate labels:

In [137]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# 5.2 Essential Functionality

>focus on familiarizing you with heavily used features, leaving the less common (i.e., more esoteric) things for you to learn more about by reading the online pandas documentation.

### Reindexing

> An important method on pandas objects is reindex, which means to create a new object with the values rearranged to align with the new index.

In [139]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "a", "c"])

In [140]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

>Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present:

In [141]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [142]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

>For ordered data like time series, you may want to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a method such as ffill, which forward-fills the values:

In [143]:
obj3 = pd.Series(["blue", "purple", "yellow"], index = [0,2,4])

In [144]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [147]:
obj3.reindex(np.arange(6), method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

> With DataFrame, ```reindex``` can alter the (row) index, columns, or both. When passed only a sequence, it reindexes the rows in the result:

In [150]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=["a","c","d"], columns = ["Ohio", "Texas", "California"])

In [151]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [153]:
frame2 = frame.reindex(index = ["a", "b","c", "d"])

In [154]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

>The columns can be reindexed with the columns keyword:

In [155]:
states =["Texas","Utah", "California"]

In [156]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

> Because "Ohio" was not in states, the data for that column is dropped from the result.

> ```Another way``` to reindex a particular axis is to pass the new axis labels as a positional argument and then specify the axis to reindex with the axis keyword:

In [158]:
frame.reindex(states, axis = "columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

> you can also reindex by using the loc operator, and many users prefer to always do it this way. This works only if all of the new index labels already exist in the DataFrame (whereas reindex will insert missing data for new labels):

In [159]:
frame.loc[["a", "d", "c"], ["California","Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

### Dropping Entries from an Axis

> Dropping one or more entries from an axis is simple if you already have an index array or list without those entries, since you can use the reindex method or .loc-based indexing. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis:

In [162]:
obj = pd.Series(np.arange(5.), index = ["a", "b", "c", "d", "e"])

In [163]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [164]:
new_obj = obj.drop("c")

In [165]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [166]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

>With DataFrame, index values can be deleted from either axis. To illustrate this, we first create an example DataFrame:

In [ ]:
# 1-16, as 4x4, index as states, columns as numbers

In [170]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index= ["Ohio", "Colorado", "Utah", "New York"], columns=["one", "two", "three", "four"])

In [171]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

>Calling drop with a sequence of labels will drop values from the row labels (axis 0):

In [172]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [173]:
data.drop(columns =["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [174]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [175]:
data.drop(["two", "four"], axis = "columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, Selection, and Filtering

>Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers

In [ ]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [176]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [177]:
obj["b"]

np.float64(1.0)

In [178]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [179]:
obj[["b", "a","d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [180]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

> While you can select data by label this way, the preferred way to select index values is with the special loc operator:

In [181]:
obj.loc[["b","a","d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

> The reason to prefer loc is because of the different treatment of integers when indexing with []. Regular []-based indexing will treat integers as labels if the index contains integers, so the behavior differs depending on the data type of the index. For example:

In [182]:
obj1 = pd.Series([1, 2, 3], index=[2,0,1])

In [183]:
obj2 = pd.Series([1,2,3], index =["a", "b", "c"])

In [184]:
obj1

2    1
0    2
1    3
dtype: int64

In [185]:
obj2

a    1
b    2
c    3
dtype: int64

In [186]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [188]:
obj2[[0,1,2]]

/var/folders/5q/z1l12s4n7y1bxgmlhw1vkr7c0000gp/T/ipykernel_80883/2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

>When using ```loc```, the expression ```obj.loc[[0, 1, 2]]``` will fail when the index does not contain integers:

In [190]:
obj2.loc[[0,1]]

KeyError: "None of [Index([0, 1], dtype='int64')] are in the [index]"

In [191]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [193]:
obj.iloc[[0,1,2]]

a    0.0
b    1.0
c    2.0
dtype: float64

In [194]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

> ```Caution``` You can also slice with labels, but it works differently from normal Python slicing in that the endpoint is inclusive:

In [195]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

>Assigning values using these methods modifies the corresponding section of the Series:

In [196]:
obj2.loc["b":"c"] = 5

In [197]:
obj2

a    1
b    5
c    5
dtype: int64

>It can be a common ```newbie``` error to try to call loc or iloc like functions rather than "indexing into" them with square brackets. The square bracket notation is used to enable slice operations and to allow for indexing on multiple axes with DataFrame objects.

In [198]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index = ["Ohio", "Colorado", "Utah", "New York"],columns=["one", "two","three", "four"])

In [199]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [200]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [201]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

>Indexing like this has a few special cases. The first is slicing or selecting data with a Boolean array:

In [202]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [206]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

>The row selection syntax ```data[:2]``` is provided as a convenience. Passing a single element or a list to the ```[]``` operator selects columns.

Another use case is indexing with a Boolean DataFrame, such as one produced by a scalar comparison. Consider a DataFrame with all Boolean values produced by comparing with a scalar value:

In [208]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

>We can use this DataFrame to assign the value 0 to each location with the value True, like so:

In [211]:
data[data<5] = 0

In [212]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection on DataFrame with loc and iloc
Like Series, DataFrame has special attributes ```loc``` and ```iloc``` for label-based and integer-based indexing, respectively. Since DataFrame is two-dimensional, you can select a subset of the rows and columns with NumPy-like notation using either axis labels (loc) or integers (iloc).

As a first example, let's select a single row by label:

In [213]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [214]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [215]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [216]:
data.loc["Colorado", ["two","three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [217]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [218]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [219]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [220]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [224]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

>Boolean arrays can be used with loc but not iloc:

In [225]:
data.loc[data.three >=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Integer indexing pitfalls
Working with pandas objects indexed by integers can be a stumbling block for new users since they work differently from built-in Python data structures like lists and tuples. For example, you might not expect the following code to generate an error:

In [227]:
ser = pd.Series(np.arange(3.))

In [228]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [229]:
ser[-1]

KeyError: -1

In [230]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [231]:
ser2 = pd.Series(np.arange(3), index = ["a", "b", "c"])

In [232]:
ser2[-1]

/var/folders/5q/z1l12s4n7y1bxgmlhw1vkr7c0000gp/T/ipykernel_80883/811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

np.int64(2)

If you have an axis index containing integers, data selection will always be label oriented. As I said above, if you use ```loc``` (for labels) or ```iloc``` (for integers) you will get exactly what you want:

In [233]:
ser.iloc[-1]

np.float64(2.0)

>On the other hand, slicing with integers is always integer oriented:

In [234]:
ser[:2]

0    0.0
1    1.0
dtype: float64

As a result of these pitfalls, it is best to always prefer indexing with ```loc``` and ```iloc``` to avoid ambiguity.

#### Pitfalls with chained indexing

In [236]:
data.loc[:,"one"] = 1

In [237]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [238]:
data.iloc[2] = 5

In [239]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [240]:
data.loc[data["four"] >5] =3

In [241]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

> A common gotcha for new pandas users is to chain selections when assigning, like this:

In [242]:
data.loc[data.three == 5]["three"]=6

/var/folders/5q/z1l12s4n7y1bxgmlhw1vkr7c0000gp/T/ipykernel_80883/4139035137.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"]=6

In [243]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

> In these scenarios, the fix is to rewrite the chained assignment to use a single loc operation:

In [244]:
data.loc[data.three == 5, "three"] = 6

In [245]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

### Arithmetic and Data Alignment

In [246]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [249]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=["a", "c", "e", "f", "g"])

In [250]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [251]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [252]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [256]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),index=["Ohio", "Texas", "Colorado"])

In [257]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),index=["Utah", "Ohio", "Texas", "Oregon"])

In [258]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [259]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

>Adding these returns a DataFrame with index and columns that are the unions of the ones in each DataFrame:

In [260]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since the "c" and "e" columns are not found in both DataFrame objects, they appear as missing in the result. The same holds for the rows with labels that are not common to both objects.

If you add DataFrame objects with no column or row labels in common, the result will contain all nulls:

In [262]:
df1 = pd.DataFrame({"A": [1,2]})

In [263]:
df2 = pd.DataFrame({"B": [3,4]})

In [264]:
df1

   A
0  1
1  2

In [265]:
df2

   B
0  3
1  4

In [266]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values
In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other. Here is an example where we set a particular value to NA (null) by assigning np.nan to it:

In [268]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns = list("abcd"))

In [270]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns = list("abcde"))

In [271]:
df2.loc[1,"b"] = np.nan

In [272]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [276]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Adding these results in missing values in the locations that don’t overlap:

In [277]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on df1, I pass df2 and an argument to fill_value, which substitutes the passed value for any missing values in the operation:

In [275]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Each has a counterpart, starting with the letter ```r```, that has arguments reversed. So these two statements are equivalent:

In [278]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [279]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill value:

In [280]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series
As with NumPy arrays of different dimensions, arithmetic between DataFrame and Series is also defined. First, as a motivating example, consider the difference between a two-dimensional array and one of its rows:

In [285]:
arr = np.arange(12.).reshape((3,4))

In [284]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [286]:
arr[0]

array([0., 1., 2., 3.])

When we subtract ```arr[0]``` from arr, the subtraction is performed once for each row. This is referred to as broadcasting and is explained in more detail as it relates to general NumPy arrays in Appendix A: Advanced NumPy. Operations between a DataFrame and a Series are similar:

In [288]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [290]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [291]:
series = frame.iloc[0]

In [292]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [293]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default, arithmetic between DataFrame and Series matches the index of the Series on the columns of the DataFrame, broadcasting down the rows:

In [294]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an index value is not found in either the DataFrame’s columns or the Series’s index, the objects will be reindexed to form the union:

In [296]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [297]:
series2

b    0
e    1
f    2
dtype: int64

In [298]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods and specify to match over the index. For example:

In [300]:
series3 = frame["d"]

In [301]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [302]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [303]:
frame.sub(series3, axis = "index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

The axis that you pass is the axis to match on. In this case we mean to match on the DataFrame’s row index (axis="index") and broadcast across the columns.

### Function Application and Mapping
NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [312]:
frame =  pd.DataFrame(np.random.standard_normal((4, 3)),
                      columns=list("bde"),
                      index=["Utah", "Ohio", "Texas", "Oregon"])

In [313]:
frame

               b         d         e
Utah   -0.305834  1.649322  0.692666
Ohio   -0.927365 -0.017591 -1.306835
Texas  -1.494842  0.726333  0.051316
Oregon  0.275045 -1.217795  0.085136

In [314]:
np.abs(frame)

               b         d         e
Utah    0.305834  1.649322  0.692666
Ohio    0.927365  0.017591  1.306835
Texas   1.494842  0.726333  0.051316
Oregon  0.275045  1.217795  0.085136

Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame’s apply method does exactly this:

In [315]:
def f1(x):
    return x.max() - x.min()

In [316]:
frame.apply(f1)

b    1.769887
d    2.867117
e    1.999501
dtype: float64

Here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame. The result is a Series having the columns of frame as its index.

If you pass axis="columns" to apply, the function will be invoked once per row instead. A helpful way to think about this is as "apply across the columns":

In [318]:
frame.apply(f1, axis="columns")

Utah      1.955156
Ohio      1.289244
Texas     2.221175
Oregon    1.492840
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

The function passed to apply need not return a scalar value; it can also return a Series with multiple values:

In [319]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min","max"])

In [320]:
frame.apply(f2)

            b         d         e
min -1.494842 -1.217795 -1.306835
max  0.275045  1.649322  0.692666

Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted string from each floating-point value in frame. You can do this with applymap:

In [328]:
def my_format(x):
    return f"{x:.2f}"

In [329]:
frame.applymap(my_format)

/var/folders/5q/z1l12s4n7y1bxgmlhw1vkr7c0000gp/T/ipykernel_80883/1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah    -0.31   1.65   0.69
Ohio    -0.93  -0.02  -1.31
Texas   -1.49   0.73   0.05
Oregon   0.28  -1.22   0.09

The reason for the name applymap is that Series has a map method for applying an element-wise function:

In [330]:
frame["e"].map(my_format)

Utah       0.69
Ohio      -1.31
Texas      0.05
Oregon     0.09
Name: e, dtype: object

### Sorting and Ranking
Sorting a dataset by some criterion is another important built-in operation. To sort lexicographically by row or column label, use the sort_index method, which returns a new, sorted object:

In [331]:
obj = pd.Series(np.arange(4), index=["d","a","b","c"])

In [332]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [333]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [339]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), 
             index=["three","one"],
             columns=["d", "a", "b", "c"])

In [340]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [341]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [342]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default but can be sorted in descending order, too:

In [343]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its sort_values method:

In [344]:
obj = pd.Series([4,7,-3,2])

In [345]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [346]:
obj = pd.Series([4, np.nan, 7, np.nan, -3,2])

In [347]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

Missing values can be sorted to the start instead by using the na_position option:

In [349]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [350]:
frame = pd.DataFrame({"b": [4,7,-3,2], "a": [0,1,0,1]})

In [351]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [352]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [353]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

```Ranking``` assigns ranks from one through the number of valid data points in an array, starting from the lowest value. The rank methods for Series and DataFrame are the place to look; by default, rank breaks ties by assigning each group the mean rank:

In [354]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [355]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the data:

In [356]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have been set to 6 and 7 because label 0 precedes label 2 in the data.

You can rank in descending order, too:

In [357]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

DataFrame can compute ranks over the rows or the columns:

In [358]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0,1,0,1],
                      "c": [-2,5,8,-2.5]})

In [359]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [360]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels
Up until now almost all of the examples we have looked at have unique axis labels (index values). While many pandas functions (like reindex) require that the labels be unique, it’s not mandatory. Let’s consider a small Series with duplicate indices:

In [362]:
obj = pd.Series(np.arange(5), index=["a","a","b","b","c"])

In [363]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The is_unique property of the index can tell you whether or not its labels are unique:

In [364]:
obj.index.is_unique

False

Data selection is one of the main things that behaves differently with duplicates. Indexing a label with multiple entries returns a Series, while single entries return a scalar value:

In [366]:
obj["a"]

a    0
a    1
dtype: int64

In [367]:
obj["c"]

np.int64(4)

This can make your code more complicated, as the output type from indexing can vary based on whether or not a label is repeated.

The same logic extends to indexing rows (or columns) in a DataFrame:

In [369]:
df = pd.DataFrame(np.random.standard_normal((5,3)),
                  index=["a","a","b","b","c"])

In [370]:
df

          0         1         2
a -1.137866 -0.094026  0.203135
a  1.642860 -1.267227  0.360939
b -0.348243 -0.974095  0.153635
b -1.014627  1.753890  1.273602
c -2.557545 -3.027605 -0.209957

In [371]:
df.loc["b"]

          0         1         2
b -0.348243 -0.974095  0.153635
b -1.014627  1.753890  1.273602

In [372]:
df.loc["c"]

0   -2.557545
1   -3.027605
2   -0.209957
Name: c, dtype: float64

# 5.3 Summarizing and Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series, or a Series of values from the rows or columns of a DataFrame. Compared with the similar methods found on NumPy arrays, they have built-in handling for missing data. Consider a small DataFrame:

In [378]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],index=["a","b","c","d"],
                  columns=["one", "two"])

In [379]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling DataFrame’s sum method returns a Series containing column sums:

In [380]:
df.sum()

one    9.25
two   -5.80
dtype: float64

Passing axis="columns" or axis=1 sums across the columns instead:

In [381]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

When an entire row or column contains all NA values, the sum is 0, whereas if any value is not NA, then the result is NA. This can be disabled with the skipna option, in which case any NA value in a row or column names the corresponding result NA:

In [382]:
df.sum(axis="index", skipna =False)

one   NaN
two   NaN
dtype: float64

In [383]:
df.sum(axis="columns",skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [385]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

Some methods, like idxmin and idxmax, return indirect statistics, like the index value where the minimum or maximum values are attained:

In [387]:
df.idxmax()

one    b
two    d
dtype: object

Other methods are accumulations:

In [388]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Some methods are neither reductions nor accumulations. describe is one such example, producing multiple summary statistics in one shot:

In [391]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

On nonnumeric data, describe produces alternative summary statistics:

In [392]:
obj = pd.Series(["a","a","b","c"] *4)

In [393]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance
Some summary statistics, like correlation and covariance, are computed from pairs of arguments. Let’s consider some DataFrames of stock prices and volumes originally obtained from Yahoo! Finance and available in binary Python pickle files you can find in the accompanying datasets for the book:

In [397]:
price = pd.read_pickle("examples/yahoo_price.pkl")

FileNotFoundError: [Errno 2] No such file or directory: 'examples/yahoo_price.pkl'

## Unique Values, Value Counts, and Membership
Another class of related methods extracts information about the values contained in a one-dimensional Series. To illustrate these, consider this example:

In [398]:
obj = pd.Series(["c","a","d","a","a","b","b","c","c"])

In [399]:
uniques = obj.unique()

In [400]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

The unique values are not necessarily returned in the order in which they first appear, and not in sorted order, but they could be sorted after the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series containing value frequencies:

In [404]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [405]:
pd.value_counts(obj.to_numpy(), sort=False)

/var/folders/5q/z1l12s4n7y1bxgmlhw1vkr7c0000gp/T/ipykernel_80883/164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64